tkuenzel/msp430g2231/msp430g2231.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USI</name>
      <description>USI</description>
      <baseAddress>120</baseAddress>
      <registers>
        <register>
          <name>USICTL0</name>
          <description>USI  Control Register 0</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>USISWRST</name>
              <description>USI  Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USIOE</name>
              <description>USI  Output Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USIGE</name>
              <description>USI  General Output Enable Latch</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USIMST</name>
              <description>USI  Master Select  0:Slave / 1:Master</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USILSB</name>
              <description>USI  LSB first  1:LSB / 0:MSB</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USIPE5</name>
              <description>USI  Port Enable Px.5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USIPE6</name>
              <description>USI  Port Enable Px.6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USIPE7</name>
              <description>USI  Port Enable Px.7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>USICTL1</name>
          <description>USI  Control Register 1</description>
          <addressOffset>1</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>USIIFG</name>
              <description>USI  Counter Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USISTTIFG</name>
              <description>USI  START Condition interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USISTP</name>
              <description>USI  STOP Condition received</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USIAL</name>
              <description>USI  Arbitration Lost</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USIIE</name>
              <description>USI  Counter Interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USISTTIE</name>
              <description>USI  START Condition interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USII2C</name>
              <description>USI  I2C Mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USICKPH</name>
              <description>USI  Sync. Mode: Clock Phase</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>USICKCTL</name>
          <description>USI  Clock Control Register</description>
          <addressOffset>2</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>USISWCLK</name>
              <description>USI  Software Clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USICKPL</name>
              <description>USI  Clock Polarity 0:Inactive=Low / 1:Inactive=High</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USISSEL</name>
              <description>USI  Clock Source Select 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USISSEL_0</name>
                  <description>USI  Clock Source: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USISSEL_1</name>
                  <description>USI  Clock Source: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USISSEL_2</name>
                  <description>USI  Clock Source: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USISSEL_3</name>
                  <description>USI  Clock Source: 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USISSEL_4</name>
                  <description>USI  Clock Source: 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USISSEL_5</name>
                  <description>USI  Clock Source: 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USISSEL_6</name>
                  <description>USI  Clock Source: 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USISSEL_7</name>
                  <description>USI  Clock Source: 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USIDIV</name>
              <description>USI  Clock Divider 2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USIDIV_0</name>
                  <description>USI  Clock Divider: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USIDIV_1</name>
                  <description>USI  Clock Divider: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USIDIV_2</name>
                  <description>USI  Clock Divider: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USIDIV_3</name>
                  <description>USI  Clock Divider: 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USIDIV_4</name>
                  <description>USI  Clock Divider: 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USIDIV_5</name>
                  <description>USI  Clock Divider: 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USIDIV_6</name>
                  <description>USI  Clock Divider: 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USIDIV_7</name>
                  <description>USI  Clock Divider: 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USICNT</name>
          <description>USI  Bit Counter Register</description>
          <addressOffset>3</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>USICNT0</name>
              <description>USI  Bit Count 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USICNT1</name>
              <description>USI  Bit Count 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USICNT2</name>
              <description>USI  Bit Count 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USICNT3</name>
              <description>USI  Bit Count 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USICNT4</name>
              <description>USI  Bit Count 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USIIFGCC</name>
              <description>USI  Interrupt Flag Clear Control</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USI16B</name>
              <description>USI  16 Bit Shift Register Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USISCLREL</name>
              <description>USI  SCL Released</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>USISRL</name>
          <description>USI  Low Byte Shift Register</description>
          <addressOffset>4</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USISRH</name>
          <description>USI  High Byte Shift Register</description>
          <addressOffset>5</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
